{
  "backend/main.mo": "Motoko canister defining user profiles, hydration/running/sleep logs, reminders, rewards, and analytics with access control and multiple storage maps.",
  "feature_evidence.json": "Empty feature evidence report structure with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend components, hooks, styles, and configuration files.",
  "frontend/.env.example": "Environment variable example file showing optional Internet Identity URL setting.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide outlining common deployment issues and solutions for the app.",
  "frontend/index.css": "Root Tailwind CSS variables and global styling for light and dark themes.",
  "frontend/index.html": "Main HTML entry page registering the service worker and loading the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app metadata, icons, categories, and display settings.",
  "frontend/public/offline.html": "Standalone offline fallback page with simple UI and retry button.",
  "frontend/public/sw.js": "Service worker implementing static asset caching, network-first fetch logic, and offline fallback handling.",
  "frontend/PWA.md": "Documentation explaining PWA installation, offline behavior, service worker checks, and troubleshooting.",
  "frontend/src/App.tsx": "Main app component handling authentication, profile setup, navigation tabs, and layout with various feature views and providers.",
  "frontend/src/components/admin/AdminAnalyticsSummary.tsx": "Displays admin analytics metrics using cards for user activity and feature usage.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard that verifies admin status and shows system analytics and user activity tables with loading and error states.",
  "frontend/src/components/admin/AdminUserAnalyticsTable.tsx": "Sortable, searchable table presenting detailed per-user analytics including activity counts and metadata.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter a name and create their profile with validation and save handling.",
  "frontend/src/components/history/EmptyState.tsx": "Simple empty-state card shown when no hydration history exists.",
  "frontend/src/components/history/HistoryView.tsx": "Displays a 7‑day intake history with stats, offline indicators, and per‑day progress cards. Fetches history data, sorts it, computes averages, and highlights days meeting goals.",
  "frontend/src/components/intake/QuickAddIntake.tsx": "Allows quick or custom water intake additions with online/offline handling, reward detection, and success toasts. Uses user settings and updates streaks, badges, and notifications.",
  "frontend/src/components/intake/TodayProgress.tsx": "Shows today’s hydration progress, streak badge, offline notice, and goal celebration. Computes remaining intake and displays a progress bar with dynamic styling.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with branding, user greeting, login button, and install‑app option. Fetches user profile to personalize the greeting.",
  "frontend/src/components/offline/OfflineStaleNotice.tsx": "Displays a warning banner when data is stale due to offline mode, optionally showing last update time. Formats timestamps into relative time text.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Shows an install button for the PWA when eligible and triggers the browser install prompt. Confirms installation via toast feedback.",
  "frontend/src/components/pwa/OfflineBanner.tsx": "Shows a fixed top banner warning the user when offline. Hides automatically when back online.",
  "frontend/src/components/reminders/InAppReminderBanner.tsx": "Displays an in‑app reminder popup with icons, title, body, and a dismiss button. Supports multiple reminder types with themed icons.",
  "frontend/src/components/reminders/ReminderControls.tsx": "Manages reminder settings, including enabling/disabling global reminders, CRUD for custom reminders, and streak‑break settings. Provides dialogs, validation, and toast feedback.",
  "frontend/src/components/reminders/StreakBreakReminderController.tsx": "Initializes streak‑break reminder logic by invoking its hook. Renders no UI.",
  "frontend/src/components/rewards/BadgesGrid.tsx": "Renders a grid of reward badges with locked/unlocked states and styling based on badge type.",
  "frontend/src/components/rewards/GoalCelebrationCard.tsx": "Displays a celebratory card with animated icons when a user hits a hydration goal.",
  "frontend/src/components/rewards/RewardsPanel.tsx": "Shows user streaks, completed goals, and earned badges with loading and empty states.",
  "frontend/src/components/running/RunHistoryList.tsx": "Fetches and displays running history with stats, offline notices, and formatted pace/time calculations.",
  "frontend/src/components/running/RunLogForm.tsx": "Form for logging runs with validation, offline support, and submission via mutation.",
  "frontend/src/components/running/RunningView.tsx": "Combines the run log form and running history list into a single view.",
  "frontend/src/components/settings/SettingsForm.tsx": "Loads and updates user settings with validation, offline queueing support, and form UI.",
  "frontend/src/components/sleep/SleepHistoryList.tsx": "Displays sleep history with averages, daily logs, offline notices, and loading/empty states using data from sleep queries.",
  "frontend/src/components/sleep/SleepLogForm.tsx": "Form for entering hours slept that validates input, submits logs via mutation, and handles offline queuing and toasts.",
  "frontend/src/components/sleep/SleepView.tsx": "Combines the sleep log form and sleep history list into a single view.",
  "frontend/src/hooks/useActor.ts": "Provides an authenticated or anonymous backend actor and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and persistent identity loading via AuthClient.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks whether the browser is online using window online/offline events.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Captures the PWA install prompt event, exposes install state, and provides a method to trigger installation.",
  "frontend/src/hooks/useQueries.ts": "Collection of data queries and mutations using the backend actor, supporting offline caching and action queuing.",
  "frontend/src/hooks/useReminderScheduler.ts": "Schedules periodic hydration reminders using notifications or in-app prompts and manages permission and running state.",
  "frontend/src/hooks/useReminderSchedulerContext.tsx": "Provides a context for managing reminder notifications, handling permissions, intervals, and showing in-app or system notifications.",
  "frontend/src/hooks/useStreakBreakReminder.ts": "Checks user streak and hydration progress and fires a streak‑break reminder near end of day, with localStorage settings and anti‑spam logic.",
  "frontend/src/index.css": "Defines global Tailwind CSS layers, custom color variables, dark mode styles, and animation utilities.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/offline/offlineQueue.ts": "Implements a per‑principal FIFO queue for offline actions with persistence and basic queue operations.",
  "frontend/src/offline/offlineStorage.ts": "Utility for reading, writing, and clearing namespaced offline data in localStorage with versioning.",
  "frontend/src/offline/OfflineSyncProvider.tsx": "Watches online status and replays queued offline actions to the backend, then invalidates caches on successful sync.",
  "frontend/src/offline/useOfflinePreference.ts": "Hook that stores and updates the user’s preference for enabling offline save behavior.",
  "frontend/src/utils/analyticsFormat.ts": "Provides helpers for formatting bigint counts, converting timestamps to readable dates, and displaying cache timestamps.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters, persisting them in sessionStorage, and managing hash-based parameter cleanup.",
  "frontend/src/vite-env.d.ts": "Defines Vite-specific TypeScript types, including an optional VITE_II_URL environment variable.",
  "frontend/tailwind.config.js": "Configures Tailwind with plugins, custom colors, animations, and extended theme settings for the frontend UI.",
  "project_state.json": "Describes project state and notes missing backend isCallerAdmin query required for admin dashboard visibility."
}