{
  "backend/main.mo": "Main canister implementing user profiles, hydration/sleep/running logs, rewards, reminders, and access control with associated storage maps.",
  "backend/migration.mo": "Migration module converting old userRewards records to a new format by adding lastUpdated.",
  "feature_evidence.json": "Feature evidence report mapping new streak-break reminder features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries for all major frontend components, hooks, and styles.",
  "frontend/.env.example": "Example environment file specifying optional Internet Identity URL.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide explaining local build/deploy steps and documenting a previously fixed frontend build failure.",
  "frontend/index.css": "Global Tailwind-based style definitions including theme variables for light and dark modes.",
  "frontend/index.html": "Base HTML file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React app shell handling authentication, profile setup, navigation tabs, and integration of reminder and tracking components.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their display name profile.",
  "frontend/src/components/history/EmptyState.tsx": "UI card shown when no history exists, encouraging users to start logging intake.",
  "frontend/src/components/history/HistoryView.tsx": "Displays water intake history with stats, sorted logs, and progress indicators, falling back to loading and empty states.",
  "frontend/src/components/intake/QuickAddIntake.tsx": "Allows quick or custom water intake logging and triggers reward-related toasts based on changes.",
  "frontend/src/components/intake/TodayProgress.tsx": "Shows today's hydration progress, streak info, and triggers a celebration when the user meets their goal.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with branding, greeting, and login button based on user profile.",
  "frontend/src/components/reminders/InAppReminderBanner.tsx": "Displays an in‑app reminder banner with contextual icons and dismiss capability.",
  "frontend/src/components/reminders/ReminderControls.tsx": "Manages global reminder settings and CRUD operations for custom reminders, including streak‑break settings.",
  "frontend/src/components/reminders/StreakBreakReminderController.tsx": "Initializes the streak‑break reminder hook without rendering UI.",
  "frontend/src/components/rewards/BadgesGrid.tsx": "Shows all badge types with unlocked states, icons, and styling variations.",
  "frontend/src/components/rewards/GoalCelebrationCard.tsx": "Displays a full‑screen celebratory card with animations when a user hits a hydration goal.",
  "frontend/src/components/rewards/RewardsPanel.tsx": "Shows user reward stats, streaks, completed goals, and earned badges with loading and empty states.",
  "frontend/src/components/running/RunHistoryList.tsx": "Fetches and displays running history with stats like total distance and pace, plus loading and empty views.",
  "frontend/src/components/running/RunLogForm.tsx": "Form for logging a run with distance, duration, and completion status, including validation and submission.",
  "frontend/src/components/running/RunningView.tsx": "Combines the run log form and running history list into a single view.",
  "frontend/src/components/settings/SettingsForm.tsx": "Displays and updates user hydration settings like daily goal and cup size with validation and saving.",
  "frontend/src/components/sleep/SleepHistoryList.tsx": "Shows sleep history with average stats, progress bars, and daily entries, including loading and empty states.",
  "frontend/src/components/sleep/SleepLogForm.tsx": "Form for logging sleep hours with validation and submission handling.",
  "frontend/src/components/sleep/SleepView.tsx": "Combines the sleep log form and sleep history list into one view.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including loading identities, login flow, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls in React Query hooks for user profiles, settings, intake, rewards, and related mutations with cache invalidation.",
  "frontend/src/hooks/useReminderScheduler.ts": "Manages local hydration reminders using notifications or in‑app prompts, with start/stop controls and interval persistence.",
  "frontend/src/hooks/useReminderSchedulerContext.tsx": "Context-based reminder scheduler supporting multiple reminder types, notifications, in‑app fallback, and manual reminder firing.",
  "frontend/src/hooks/useStreakBreakReminder.ts": "Checks hydration streak progress and triggers a streak‑break warning reminder near end of day with daily anti‑spam logic.",
  "frontend/src/index.css": "Defines Tailwind base layers, theme CSS variables for light/dark mode, and custom utility animations and classes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/vite-env.d.ts": "Declares Vite-specific environment variable typings for TypeScript.",
  "frontend/tailwind.config.js": "Configures Tailwind with dark mode, content paths, extended colors mapped to CSS variables, custom radii, shadows, and keyframes.",
  "project_state.json": "Stores the project's current state, feature list, issues, and architectural notes for tracking development progress."
}