{
  "backend/main.mo": "Main canister actor defining user profiles, rewards, logs, reminders, analytics, and access‑controlled CRUD operations with migration applied on upgrade.",
  "backend/migration.mo": "Migration module converting old user analytics records by removing the lastActiveDay field while preserving existing counters.",
  "feature_evidence.json": "Feature evidence report listing frontend files and components involved in removing per‑user last‑active UI displays.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend components, hooks, and configuration files.",
  "frontend/.env.example": "Example environment file providing the Internet Identity URL configuration.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide detailing common deployment issues and fixes for the Hydration Tracker app.",
  "frontend/index.css": "Tailwind base and theme variable definitions including color tokens, radii, and dark‑mode overrides.",
  "frontend/index.html": "Main HTML entry registering the service worker and loading the React app root element.",
  "frontend/public/manifest.webmanifest": "PWA manifest declaring app metadata, icons, colors, and display settings.",
  "frontend/public/offline.html": "Standalone offline fallback page with styling and retry button for when the app cannot load.",
  "frontend/public/sw.js": "Service worker caching static assets, cleaning old caches, and handling network-first fetch with offline fallback.",
  "frontend/PWA.md": "Documentation explaining PWA installation, offline behavior, service worker details, and troubleshooting.",
  "frontend/src/App.tsx": "Main app component handling authentication state, profile setup, and rendering tabs, views, and banners.",
  "frontend/src/components/admin/AdminAnalyticsSummary.tsx": "Displays admin analytics summary cards for total users and feature event counts.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard fetching analytics, handling loading and errors, and rendering summary, user analytics, and debug sections.",
  "frontend/src/components/admin/AdminDebugInfo.tsx": "Shows principal ID, allows copying it, and tests backend identity via whoami for debugging.",
  "frontend/src/components/admin/AdminUserAnalyticsTable.tsx": "Searchable, sortable table listing per-user activity metrics with optional selection callback.",
  "frontend/src/components/admin/AdminUserResponsesSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with handling for login states and errors.",
  "frontend/src/components/auth/LoginShareLink.tsx": "Provides share and copy actions for the current URL using Web Share API or clipboard fallback with UI feedback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting the user to enter a name and submit it to create their profile.",
  "frontend/src/components/history/EmptyState.tsx": "Displays a styled empty state card when no intake history exists.",
  "frontend/src/components/history/HistoryView.tsx": "Shows water intake history with stats, progress, offline notice, and per‑day logs.",
  "frontend/src/components/intake/QuickAddIntake.tsx": "Enables quick water‑intake additions, handles offline queuing, reward updates, and goal completion logic.",
  "frontend/src/components/intake/TodayProgress.tsx": "Displays today's water intake progress, daily goal, streak, and offline status.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with branding, user greeting, install button, and login button.",
  "frontend/src/components/offline/OfflineStaleNotice.tsx": "Shows a notice when data is stale due to offline mode, including last-updated timestamp.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Button to trigger PWA installation when available and not already installed.",
  "frontend/src/components/pwa/OfflineBanner.tsx": "Displays a banner warning the user when the app detects offline mode.",
  "frontend/src/components/reminders/AdminUsersTable.tsx": "Empty file with no implemented content.",
  "frontend/src/components/reminders/InAppReminderBanner.tsx": "Shows a fixed in‑app reminder banner with an icon, title, body, and dismiss button based on reminder type.",
  "frontend/src/components/reminders/ReminderControls.tsx": "Provides UI to manage hydration, sleep, streak-break, and custom reminders, including toggles, creation, updates, and deletion.",
  "frontend/src/components/reminders/StreakBreakReminderController.tsx": "Runs the streak-break reminder hook and renders nothing.",
  "frontend/src/components/rewards/BadgesGrid.tsx": "Displays all badge types with unlock state styling based on earned rewards.",
  "frontend/src/components/rewards/GoalCelebrationCard.tsx": "Renders a celebratory card overlay for achieving a daily goal with animated icons and messages.",
  "frontend/src/components/rewards/RewardsPanel.tsx": "Shows user rewards such as streak, completed goals, and badges with loading and error states.",
  "frontend/src/components/running/RunHistoryList.tsx": "Displays sorted running history with offline indicators, completion status, and formatted run details.",
  "frontend/src/components/running/RunLogForm.tsx": "Form for logging runs with validation, online/offline handling, and submission to backend.",
  "frontend/src/components/running/RunningView.tsx": "Combines the run logging form and running history list into one view.",
  "frontend/src/components/settings/SettingsForm.tsx": "Form that loads, edits, and saves user hydration settings with online/offline handling and validation.",
  "frontend/src/components/sleep/SleepHistoryList.tsx": "Displays sleep history with averages, offline indicators, sorting, and empty states.",
  "frontend/src/components/sleep/SleepLogForm.tsx": "Form to submit sleep hours with validation, online/offline queuing, and success/error toasts.",
  "frontend/src/components/sleep/SleepView.tsx": "Combines the sleep log form and history list into a single view.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refetches dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handlers, and persistent identity loading.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status via window events.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Handles PWA install prompt events and exposes installability and prompt invocation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for user profiles, settings, admin checks, hydration/sleep data, and offline-capable mutations.",
  "frontend/src/hooks/useReminderScheduler.ts": "Provides a hook for managing hydration reminders, including notification permission, interval scheduling, and in‑app fallback reminders.",
  "frontend/src/hooks/useReminderSchedulerContext.tsx": "Implements a context-based reminder scheduler supporting multiple reminder types, notification handling, and shared state for firing and displaying reminders.",
  "frontend/src/hooks/useStreakBreakReminder.ts": "Checks streak-related conditions and triggers a streak‑break reminder near day end, with localStorage settings and daily anti‑spam logic.",
  "frontend/src/index.css": "Defines Tailwind base styles, color variables, dark mode palettes, and custom animation utilities.",
  "frontend/src/main.tsx": "Initializes the React app root with React Query and Internet Identity providers.",
  "frontend/src/offline/offlineQueue.ts": "Implements a per‑principal persistent FIFO queue for offline actions, supporting enqueueing, dequeueing, peeking, and clearing.",
  "frontend/src/offline/offlineStorage.ts": "Provides versioned, per‑principal localStorage utilities for reading, writing, and clearing offline‑persisted data.",
  "frontend/src/offline/OfflineSyncProvider.tsx": "Monitors online status and syncs queued offline actions to the backend, updating caches and showing success or failure toasts.",
  "frontend/src/offline/useOfflinePreference.ts": "Hook managing a persisted offline-saving preference in localStorage.",
  "frontend/src/utils/analyticsFormat.ts": "Formats bigint counts with suffixes and converts timestamps to relative time strings.",
  "frontend/src/utils/backendError.ts": "Normalizes backend errors into readable user-facing messages based on pattern matching.",
  "frontend/src/utils/clipboard.ts": "Provides clipboard copying with a fallback and checks for Web Share API support.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL/session parameters for routing and state.",
  "frontend/src/vite-env.d.ts": "Type definitions for Vite environment variables.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radius, shadows, animations, and plugin setup.",
  "project_state.json": "Project metadata and feature requests for removing per-user last‑active data."
}