{
  "backend/main.mo": "Motoko canister defining user profiles, logs, rewards, and reminders with access control and multiple Map-based stores.",
  "feature_evidence.json": "Feature evidence report listing offline-first, caching, and settings‑related features with associated files and metadata.",
  "frontend-file-summaries.txt": "Collected summaries of various frontend components, hooks, and styles used across the app.",
  "frontend/.env.example": "Example environment file defining optional Internet Identity URL.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide outlining common deployment issues and solutions for the app.",
  "frontend/index.css": "Tailwind base styles and custom CSS variables for light and dark themes.",
  "frontend/index.html": "HTML entry point registering the service worker and bootstrapping the React app.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theming, and display behavior.",
  "frontend/public/offline.html": "Standalone offline fallback page with styled message and retry button.",
  "frontend/public/sw.js": "Service worker handling caching, offline fallback, and network-first fetch logic.",
  "frontend/PWA.md": "Documentation explaining PWA installation, offline behavior, updating, and troubleshooting.",
  "frontend/src/App.tsx": "Main app component managing authentication flow, profile setup, and navigation between feature views.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading state and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new users to enter and save their name during profile setup.",
  "frontend/src/components/history/EmptyState.tsx": "Displays a decorative empty state when no intake history is available.",
  "frontend/src/components/history/HistoryView.tsx": "Fetches and displays intake history with stats, offline notice, and daily progress cards.",
  "frontend/src/components/intake/QuickAddIntake.tsx": "Allows quick water intake logging, handles online/offline behavior, and triggers reward toasts.",
  "frontend/src/components/intake/TodayProgress.tsx": "Displays today's hydration progress, streak, and goal celebration with offline and loading states.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app header with logo, greeting, install button, and login control.",
  "frontend/src/components/offline/OfflineStaleNotice.tsx": "Shows a warning when data is stale due to offline mode, including last-updated time.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Provides a button to trigger the PWA install prompt when available.",
  "frontend/src/components/pwa/OfflineBanner.tsx": "Displays a fixed banner warning the user when the app is offline.",
  "frontend/src/components/reminders/InAppReminderBanner.tsx": "Shows an in-app notification banner for scheduled reminders with dismiss controls.",
  "frontend/src/components/reminders/ReminderControls.tsx": "Manages custom reminders and streak-break settings with add, edit, toggle, and delete actions.",
  "frontend/src/components/reminders/StreakBreakReminderController.tsx": "Initializes streak-break reminder logic without rendering UI.",
  "frontend/src/components/rewards/BadgesGrid.tsx": "Renders a grid of reward badges, showing unlocked status and icons.",
  "frontend/src/components/rewards/GoalCelebrationCard.tsx": "Shows a full-screen celebratory card when the hydration goal is achieved.",
  "frontend/src/components/rewards/RewardsPanel.tsx": "Displays reward stats including streak, completed goals, and earned badges.",
  "frontend/src/components/running/RunHistoryList.tsx": "Displays running history with stats, handles loading/offline states, and formats pace and time.",
  "frontend/src/components/running/RunLogForm.tsx": "Form to log a run with distance and duration, validating input and supporting offline queueing.",
  "frontend/src/components/running/RunningView.tsx": "Combines the run log form and history list into a single view.",
  "frontend/src/components/settings/SettingsForm.tsx": "Settings form to update daily hydration goals and cup size with offline support and input validation.",
  "frontend/src/components/sleep/SleepHistoryList.tsx": "Displays sleep history with averages, progress indicators, and offline awareness.",
  "frontend/src/components/sleep/SleepLogForm.tsx": "Form to log hours slept with validation and offline queueing.",
  "frontend/src/components/sleep/SleepView.tsx": "Combines sleep log form and sleep history list into one view.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity auth, handling login, logout, stored identity loading, and auth-client creation.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks browser online/offline status using window events.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Manages the deferred PWA install prompt, tracks installability, and exposes an install trigger.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data, with offline support and queuing for updates.",
  "frontend/src/hooks/useReminderScheduler.ts": "Schedules periodic hydration reminders using notifications or in‑app prompts, managing permissions and intervals.",
  "frontend/src/hooks/useReminderSchedulerContext.tsx": "Provides a context-based reminder scheduler supporting multiple reminder types, notifications, and in‑app fallback.",
  "frontend/src/hooks/useStreakBreakReminder.ts": "Fires streak‑break hydration reminders near end of day based on user streak, goals, and anti‑spam rules.",
  "frontend/src/index.css": "Defines Tailwind layers, theme CSS variables, dark mode palette, utility animations, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global CSS.",
  "frontend/src/offline/offlineQueue.ts": "Implements a per‑principal FIFO offline action queue with persistence through localStorage.",
  "frontend/src/offline/offlineStorage.ts": "Provides versioned, namespaced localStorage utilities for saving, reading, and clearing offline data.",
  "frontend/src/offline/OfflineSyncProvider.tsx": "Watches online status to replay queued offline actions, syncs them via the actor, and invalidates caches.",
  "frontend/src/offline/useOfflinePreference.ts": "React hook storing the user’s offline‑saving preference in localStorage.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and persisting URL parameters using URLSearchParams and sessionStorage.",
  "frontend/src/vite-env.d.ts": "Type definitions extending Vite’s import meta environment variables.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, animations, containers, and theming based on CSS variables.",
  "project_state.json": "Describes the project’s state, including goals for admin-only analytics, gamification updates, and known issues like broken sleep badge logic and deployment errors."
}