{
  "backend/main.mo": "Motoko canister implementing user profiles, hydration, sleep, running logs, and custom reminders with access control and permission checks.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, related frontend files, components, and confidence metadata for recent app enhancements.",
  "frontend-file-summaries.txt": "Lookup file providing short descriptions of each frontend component, hook, and view for documentation or build planning.",
  "frontend/index.css": "Global Tailwind-based theme definitions including OKLCH color tokens and dark-mode variants.",
  "frontend/index.html": "HTML entry point that defines the root element and loads the main TypeScript application module.",
  "frontend/src/App.tsx": "Main React app handling authentication, profile setup, reminders, hydration UI, and tab navigation for sleep, running, history, and settings.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for first-time profile creation collecting the user's display name and saving it to the backend.",
  "frontend/src/components/history/EmptyState.tsx": "Placeholder card shown when no hydration history exists, encouraging the user to start logging intake.",
  "frontend/src/components/history/HistoryView.tsx": "Displays water intake history, including daily progress, averages, and goal indicators using sorted logs.",
  "frontend/src/components/intake/QuickAddIntake.tsx": "Provides quick and custom water intake logging with preset amounts and input validation.",
  "frontend/src/components/intake/TodayProgress.tsx": "Shows today's water intake progress toward the daily goal with remaining amount or goal-achieved status.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the main app header with branding, optional user greeting, and login button.",
  "frontend/src/components/reminders/InAppReminderBanner.tsx": "Displays a temporary in-app reminder banner with icon, message, and dismiss control.",
  "frontend/src/components/reminders/ReminderControls.tsx": "Manages hydration reminders, including permission status, starting/pausing reminders, and CRUD for custom reminders.",
  "frontend/src/components/running/RunHistoryList.tsx": "Shows running history with recent stats, sorted logs, and formatted distance, pace, and time info.",
  "frontend/src/components/running/RunLogForm.tsx": "Form to log a run with distance, duration, pace calculation, completion status, and input validation.",
  "frontend/src/components/running/RunningView.tsx": "Displays the running tracker with a form to log runs and a list of past run history.",
  "frontend/src/components/settings/SettingsForm.tsx": "Provides a form to view and update user hydration settings with validation and backend syncing.",
  "frontend/src/components/sleep/SleepHistoryList.tsx": "Fetches and displays sleep history with averages, progress bars, and daily breakdowns.",
  "frontend/src/components/sleep/SleepLogForm.tsx": "Form for logging hours slept with input validation and backend submission.",
  "frontend/src/components/sleep/SleepView.tsx": "Composes the sleep tracker page with a log form and history list.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login handling, and identity persistence via context.",
  "frontend/src/hooks/useQueries.ts": "Contains React Query hooks for fetching and mutating user profile, hydration, sleep, and related backend data.",
  "frontend/src/hooks/useReminderScheduler.ts": "Provides a hook to manage hydration reminders with notification permission handling, interval scheduling, and fallback in‑app reminders.",
  "frontend/src/hooks/useReminderSchedulerContext.tsx": "Implements a context-based reminder scheduler supporting multiple reminder types, notification handling, and shared app-wide reminder state.",
  "frontend/src/index.css": "Defines Tailwind base styles and a hydration-themed OKLCH color system with light and dark mode variables.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters and session-stored parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, animations, plugins, and container settings.",
  "project_state.json": "Tracks project features, requirements, and metadata for expanding the app into a broader health reminder and tracking system."
}