{
  "backend/main.mo": "Main actor with access control, user types, and storage maps for hydration, sleep, running, reminders, rewards, and analytics.",
  "backend/migration.mo": "Migration module defining legacy types and upgrading userRewards by adjusting streak values.",
  "feature_evidence.json": "Feature evidence report mapping a frontend update to specific files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend components, hooks, and styles used across the app.",
  "frontend/.env.example": "Example environment file specifying the Internet Identity URL.",
  "frontend/DEPLOYMENT_TROUBLESHOOTING.md": "Guide covering common deployment issues and solutions for the app.",
  "frontend/index.css": "Global Tailwind CSS variables and theme definitions for light and dark modes.",
  "frontend/index.html": "HTML entry point that loads the app, registers the service worker, and sets PWA metadata.",
  "frontend/public/manifest.webmanifest": "PWA manifest defining app name, icons, theme colors, and display settings.",
  "frontend/public/offline.html": "Standalone offline fallback page with styled message, icon, and retry link.",
  "frontend/public/sw.js": "Service worker handling caching, offline fallback, and network-first fetch strategy.",
  "frontend/PWA.md": "Documentation explaining PWA installation, offline support, updates, and troubleshooting.",
  "frontend/src/App.tsx": "Main app component managing authentication, profile setup flow, UI layout, and feature tabs.",
  "frontend/src/components/admin/AdminAnalyticsSummary.tsx": "Renders admin summary cards showing user activity and feature usage metrics.",
  "frontend/src/components/admin/AdminDashboard.tsx": "Admin dashboard that loads analytics, handles auth checks, and displays summaries or errors.",
  "frontend/src/components/admin/AdminDebugInfo.tsx": "Debug panel showing principal, clipboard copy, and backend whoami test utilities.",
  "frontend/src/components/admin/AdminUserAnalyticsTable.tsx": "Displays searchable and sortable user analytics in a table and allows selecting a user entry.",
  "frontend/src/components/admin/AdminUserResponsesSection.tsx": "File exists but contains no implementation.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles Internet Identity login/logout with loading states and error recovery.",
  "frontend/src/components/auth/LoginShareLink.tsx": "Allows users to share or copy the current login link using Web Share API or clipboard fallback.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal for entering and saving a user's profile name upon first-time setup.",
  "frontend/src/components/history/EmptyState.tsx": "Shows a decorative message when no intake history is available.",
  "frontend/src/components/history/HistoryView.tsx": "Displays water intake history with stats, progress indicators, sorting, and offline handling.",
  "frontend/src/components/intake/QuickAddIntake.tsx": "Enables quick logging of water intake, updating rewards, streaks, and handling offline queuing.",
  "frontend/src/components/intake/TodayProgress.tsx": "Shows today's water intake progress, streaks, and offline state with a visual progress card.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the app’s header with branding, user greeting, and install/login buttons using user profile data.",
  "frontend/src/components/offline/OfflineStaleNotice.tsx": "Shows an offline stale-data warning with optional timestamp formatting.",
  "frontend/src/components/pwa/InstallAppButton.tsx": "Displays a PWA install button when installable and triggers the install prompt with success feedback.",
  "frontend/src/components/pwa/OfflineBanner.tsx": "Shows a fixed banner warning the user when the app detects offline status.",
  "frontend/src/components/reminders/AdminUsersTable.tsx": "Empty placeholder file for an admin users table component.",
  "frontend/src/components/reminders/InAppReminderBanner.tsx": "Shows an in‑app reminder banner with icon, message, and dismiss action based on scheduler context.",
  "frontend/src/components/reminders/ReminderControls.tsx": "Provides UI for toggling predefined reminders and managing custom reminders with CRUD operations.",
  "frontend/src/components/reminders/StreakBreakReminderController.tsx": "Runs the streak‑break reminder hook and renders nothing.",
  "frontend/src/components/rewards/BadgesGrid.tsx": "Displays all badge types with locked/unlocked states and icons based on user rewards.",
  "frontend/src/components/rewards/GoalCelebrationCard.tsx": "Shows a celebratory card when a user hits their hydration goal, with animated icons and streak info.",
  "frontend/src/components/rewards/RewardsPanel.tsx": "Fetches and displays user reward stats, streaks, completed goals, and earned badges.",
  "frontend/src/components/running/RunHistoryList.tsx": "Lists running history with offline handling, loading state, and formatted run entries sorted by time.",
  "frontend/src/components/running/RunLogForm.tsx": "Form component for logging running distance, duration, and completion status with validation and offline support.",
  "frontend/src/components/running/RunningView.tsx": "Combines the run log form and run history list into a single view.",
  "frontend/src/components/settings/SettingsForm.tsx": "Displays and updates user hydration settings with validation, offline queuing, and loading states.",
  "frontend/src/components/sleep/SleepHistoryList.tsx": "Fetches, sorts, and displays sleep history with averages, offline indicators, and conditional empty states.",
  "frontend/src/components/sleep/SleepLogForm.tsx": "Form for submitting hours slept with validation and offline mutation support.",
  "frontend/src/components/sleep/SleepView.tsx": "Displays the sleep log form and sleep history list together.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login handling, stored identity loading, and context management.",
  "frontend/src/hooks/useOnlineStatus.ts": "Tracks and returns the browser’s online/offline status via window events.",
  "frontend/src/hooks/usePWAInstallPrompt.ts": "Handles PWA install prompt events and exposes installability state and a method to trigger installation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data with offline support and actor-based backend calls.",
  "frontend/src/hooks/useReminderScheduler.ts": "Provides a local reminder scheduler using intervals, notifications, and in‑app fallback reminders.",
  "frontend/src/hooks/useReminderSchedulerContext.tsx": "Implements a context-based reminder scheduler supporting multiple reminder types and centralized notification handling.",
  "frontend/src/hooks/useStreakBreakReminder.ts": "Checks user streak, intake, and settings to trigger end‑of‑day streak‑break warnings with daily anti‑spam logic.",
  "frontend/src/index.css": "Tailwind CSS setup with custom theme variables and animation utilities for light and dark modes.",
  "frontend/src/main.tsx": "Initializes React root and wraps the app with QueryClient and InternetIdentity providers.",
  "frontend/src/offline/offlineQueue.ts": "Implements a per-user FIFO offline action queue with persistence using offlineStorage.",
  "frontend/src/offline/offlineStorage.ts": "Provides JSON-based localStorage helpers with namespacing, versioning, and safe read/write/clear operations.",
  "frontend/src/offline/OfflineSyncProvider.tsx": "Monitors connectivity and syncs queued offline actions to the backend, then invalidates related React Query caches.",
  "frontend/src/offline/useOfflinePreference.ts": "React hook that stores and retrieves the user’s offline-saving preference in localStorage.",
  "frontend/src/utils/analyticsFormat.ts": "Formats bigint counts, timestamps, and cache ages into readable strings for analytics display.",
  "frontend/src/utils/backendError.ts": "Normalizes backend or agent error messages into concise, user-friendly strings.",
  "frontend/src/utils/clipboard.ts": "Implements robust copy-to-clipboard logic with Clipboard API and DOM fallback plus share support detection.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL/session parameters for both query and hash routing.",
  "frontend/src/vite-env.d.ts": "Declares Vite env typings including optional VITE_II_URL.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugin usage for the frontend.",
  "project_state.json": "Describes project state, known issues, and pending feature requests related to streaks, goals, and rewards."
}