{
  "kind": "build_request",
  "title": "Expand app with sleep scheduling, running tracker, and additional health reminders/tracking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-9",
      "text": "Add backend data models and actor APIs for sleep scheduling and sleep tracking stored per authenticated caller Principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add sleep scheduler, running tracker and other health reminders and tracker"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes query + update APIs to save and retrieve the caller’s sleep schedule settings (at minimum: enabled flag, target bedtime, target wake time, and applicable days of week).",
        "Backend exposes APIs to add a sleep log entry and to fetch recent sleep log history for the caller.",
        "All sleep schedule/log APIs enforce the same authorization pattern used by existing hydration APIs (caller must have #user permission; no cross-user access)."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add backend data models and actor APIs for a running tracker that lets an authenticated user log runs and view basic running history/stats stored per caller Principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add sleep scheduler, running tracker and other health reminders and tracker"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes an API to add a run log entry (at minimum: date/time, distance, duration; optional notes).",
        "Backend exposes an API to fetch recent run history for the caller.",
        "All running APIs enforce the same authorization pattern used by existing hydration APIs (caller must have #user permission; no cross-user access)."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add backend support for additional (non-hydration) health reminders by allowing users to create, update, list, and delete custom reminder definitions stored per caller Principal.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add sleep scheduler, running tracker and other health reminders and tracker"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes APIs to create/list/update/delete reminder definitions for the caller.",
        "A reminder definition includes (at minimum) a user-visible title, an enabled flag, and a schedule configuration sufficient for the frontend to trigger reminders (e.g., time-of-day OR repeating interval minutes).",
        "All reminder APIs enforce the same authorization pattern used by existing hydration APIs (caller must have #user permission; no cross-user access)."
      ]
    },
    {
      "id": "REQ-12",
      "text": "Extend the frontend UI to include new sections for Sleep and Running, alongside existing Hydration features, using clear navigation within the existing App layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add sleep scheduler, running tracker and other health reminders and tracker"
        ]
      },
      "acceptanceCriteria": [
        "Authenticated users can navigate to a Sleep section where they can configure a sleep schedule and log sleep entries, and can view a recent sleep history list.",
        "Authenticated users can navigate to a Running section where they can log runs and view a recent run history list with basic summary stats (e.g., total distance for last 7 days and/or average pace derived from logged data).",
        "All new user-facing text is in English.",
        "Existing hydration tabs/features (Reminders, History, Settings, Today’s progress, Quick add) remain functional."
      ]
    },
    {
      "id": "REQ-13",
      "text": "Add React Query hooks and frontend data flow for sleep, running, and custom reminders using the existing actor-based pattern.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add sleep scheduler, running tracker and other health reminders and tracker"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/hooks/useQueries.ts (or additional hook modules) includes query/mutation hooks for sleep schedule, sleep logs, run logs, and custom reminder definitions.",
        "On successful mutations, the correct cached queries are invalidated so the UI refreshes without a manual reload.",
        "Hooks work with Internet Identity authentication and handle the actor-not-available state consistently with existing hooks."
      ]
    },
    {
      "id": "REQ-14",
      "text": "Update the in-app reminder scheduler to support triggering reminders for the new reminder types (sleep and user-defined health reminders) in addition to hydration, using browser Notifications when permitted and otherwise an in-app banner/toast.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Add sleep scheduler, running tracker and other health reminders and tracker"
        ]
      },
      "acceptanceCriteria": [
        "The scheduler can display distinct reminder content (title/body) for different reminder types (e.g., Hydration vs Sleep vs Custom).",
        "When Notification permission is granted, notifications use an appropriate tag per reminder type so repeated notifications behave predictably in the browser.",
        "When Notification permission is not granted or notification display fails, an in-app reminder UI is shown that clearly indicates which reminder fired (English text).",
        "The existing hydration reminder controls continue to work, and new reminder types can be enabled/disabled without breaking hydration reminders."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: keep all Motoko logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths listed in SYSTEM_CONTEXT.",
    "Use Internet Identity as the only authentication mechanism; store all user data per Principal.",
    "Do not add external databases or third-party real-time services; scheduling remains in-browser while the app is open."
  ],
  "nonGoals": [
    "Integrating wearable devices or importing data from Apple Health / Google Fit / Strava.",
    "True background notifications or push notifications when the app/tab is closed.",
    "Advanced running analytics (GPS routes, maps, VO2 max, cadence) beyond basic logged entries and simple derived stats.",
    "Medical advice features or diagnosis features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}