{
  "kind": "build_request",
  "title": "Add streak-break reminder (streak at risk) with accurate streak tracking",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-25",
      "text": "Update backend hydration streak logic so the stored streak represents consecutive days where the user met their daily hydration goal, and automatically resets when a day is missed.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add streak break"
        ]
      },
      "acceptanceCriteria": [
        "When a user meets their daily goal on consecutive days, the streak increments by 1 per day.",
        "If the user misses a day (gap of 2+ days since the last goal-met day), the streak resets to 0 (or restarts at 1 on the next goal-met day).",
        "Meeting the goal multiple times in the same calendar day does not increment the streak more than once for that day.",
        "getUserRewards returns a streak value that is consistent with the consecutive-days rule (including after time has passed without new writes)."
      ]
    },
    {
      "id": "REQ-26",
      "text": "Add a conditional Motoko state migration (backend/migration.mo) to safely upgrade existing stored user rewards to the updated streak data structure used by the new consecutive-day streak logic.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add streak break"
        ]
      },
      "acceptanceCriteria": [
        "Project upgrades without trapping due to missing/new fields in persisted rewards data.",
        "Existing users keep their current streak count (or it is deterministically normalized using the new logic) after upgrade."
      ]
    },
    {
      "id": "REQ-27",
      "text": "Implement a new local streak-break reminder that notifies the user when their current hydration streak is at risk of breaking (streak > 0 and today’s goal is not yet met, near end-of-day). Use browser notifications when permitted; otherwise show the existing in-app reminder banner.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add streak break"
        ]
      },
      "acceptanceCriteria": [
        "When streak > 0 and today’s hydration goal is not yet met, a streak-break reminder can fire during a configurable “warning window” near the end of the user’s local day.",
        "The reminder uses the browser Notification API if permission is granted; otherwise it appears in the existing InAppReminderBanner UI.",
        "The reminder content is English, chill/encouraging, and not aggressive or shaming.",
        "The streak-break reminder does not spam: at most once per local calendar day (per user/device) unless the user dismisses and re-enables it explicitly."
      ]
    },
    {
      "id": "REQ-28",
      "text": "Expose user controls in the existing Reminders UI to enable/disable the streak-break reminder and configure the warning window timing (e.g., number of hours before day end). Persist these preferences locally (device) using localStorage.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Add streak break"
        ]
      },
      "acceptanceCriteria": [
        "A user can toggle the streak-break reminder on/off from the Reminders tab.",
        "A user can adjust the warning window timing (hours before end of day) and the app uses that setting immediately.",
        "Settings persist across reloads on the same device via localStorage.",
        "All user-facing labels/help text are in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Generate backend/migration.mo only as needed for upgrading existing stable state (conditional migration).",
    "Do not modify files under frontend/src/components/ui or any other frontend immutablePaths; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add push notifications, background OS scheduling, WebSockets, or any server-side cron/scheduler.",
    "Do not introduce third-party authentication providers beyond Internet Identity.",
    "Do not add external databases or off-canister storage/services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}