{
  "kind": "build_request",
  "title": "Add offline saved content mode (queue + cache user data for offline use)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-34",
      "text": "Add offline-first persistence for user-generated tracking actions so users can continue using the app while offline: when the device is offline, queue hydration intake logs, sleep logs, running logs, and settings updates locally and automatically sync them to the backend when connectivity is restored.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes save"
        ]
      },
      "acceptanceCriteria": [
        "When the browser is offline, submitting any of the following actions does not error and instead saves locally: addDailyIntake, addSleepLog, logRun, updateUserSettings.",
        "Queued offline actions are persisted across page reloads (e.g., via localStorage) until successfully synced.",
        "When the browser returns online, queued actions are replayed automatically in the original order and removed from the queue only after backend success.",
        "If a queued action fails to sync (backend error), the UI surfaces a non-blocking English message explaining sync failed and keeps the item queued for a later retry.",
        "After sync completes, relevant React Query caches are refreshed so Today/History/Rewards reflect server state."
      ]
    },
    {
      "id": "REQ-35",
      "text": "Cache the last successfully fetched user data locally so the app can display meaningful read-only content while offline, including today’s totals and recent history for hydration, sleep, and running.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes save"
        ]
      },
      "acceptanceCriteria": [
        "When online, successful fetches for today’s values and history lists store a copy locally (per signed-in principal).",
        "When offline, the app displays the last cached values for today’s progress and history views (hydration/sleep/running) instead of showing only loading/errors.",
        "The UI clearly indicates the data may be stale while offline using English copy (e.g., “Showing saved data from your last connection.”).",
        "Offline read-only rendering does not require any backend calls and does not crash if no cached data exists (falls back to existing empty/loading states)."
      ]
    },
    {
      "id": "REQ-36",
      "text": "Expose a simple in-app control to enable/disable “Save for offline use” behavior on the device, and provide English helper text describing what is saved and that sync happens when back online.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Yes save"
        ]
      },
      "acceptanceCriteria": [
        "A toggle labeled in English (e.g., “Save for offline use”) is available in an existing settings surface.",
        "When disabled, the app does not queue new offline actions and does not write new offline caches (existing queued items/caches may be left intact unless the user explicitly clears them).",
        "When enabled, behavior matches REQ-34 and REQ-35.",
        "User preference is persisted locally on the device and restored on reload."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not modify frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Implementing real-time sync or WebSocket-based updates.",
    "Providing cross-device offline queue synchronization (offline data is device-local only).",
    "Adding a new backend storage layer or changing Motoko canister state specifically for offline support."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}