{
  "kind": "build_request",
  "title": "Remove per-user last active status from analytics and UI",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove any per-user \"last active\" display from the frontend UI, including the admin user analytics table column currently labeled \"Last Active\" and any formatting helpers used solely for that display.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I dont want users last active status"
        ]
      },
      "acceptanceCriteria": [
        "Admin user analytics table no longer shows a \"Last Active\" column or any per-user last-active date/relative time.",
        "No user-facing text anywhere in the app includes \"Last Active\" for an individual user.",
        "Frontend builds successfully after removing/adjusting any imports/usages tied to per-user last active formatting (e.g., formatLastActiveDay if it becomes unused)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Stop exposing per-user last active timestamps from the backend admin/user-analytics data model and APIs (e.g., remove/stop populating fields like `UserAnalytics.lastActiveDay` and `UserAnalyticsEntry.issuedDay` used to represent last activity). Keep aggregate analytics working without returning per-user last-active data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I dont want users last active status"
        ]
      },
      "acceptanceCriteria": [
        "Backend no longer returns a per-user last-active timestamp/day in any admin/user analytics response.",
        "Calls that previously updated per-user last-active fields no longer do so (hydration/sleep/running logging should not write per-user last-active state).",
        "Aggregate analytics endpoints (e.g., total users, total event counts, DAU/WAU if present) continue to work, but are computed without storing/exposing per-user last-active timestamps.",
        "Motoko canister compiles and frontend generated types remain consistent with updated backend types."
      ]
    },
    {
      "id": "REQ-3",
      "text": "If existing stable/persistent state contains per-user last-active fields, add a conditional migration that safely upgrades stored analytics data to the new schema (dropping last-active data or mapping it to a schema without last-active fields) without data loss for other analytics counters.",
      "target": "backend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "I dont want users last active status"
        ]
      },
      "acceptanceCriteria": [
        "Upgrade from the current deployed state completes without traps.",
        "Existing users retain their non-last-active analytics counters (e.g., totals) after upgrade.",
        "No per-user last-active values remain accessible after upgrade."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT; compose existing UI components instead."
  ],
  "nonGoals": [
    "Changing authentication (Internet Identity) behavior.",
    "Adding new analytics features beyond removing per-user last active visibility/storage.",
    "Implementing real-time presence/online indicators."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Do not show or expose per-user \"last active\" status."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}