{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Streak-break reminder controls and local notification/in-app fallback",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Add a local streak-break reminder that fires near end-of-day when streak > 0 and today’s hydration goal is not met, using browser notifications when allowed or the in-app banner otherwise, with once-per-day anti-spam.",
      "acceptanceCriteria": [
        "When streak > 0 and today’s hydration goal is not yet met, a streak-break reminder can fire during a configurable “warning window” near the end of the user’s local day.",
        "The reminder uses the browser Notification API if permission is granted; otherwise it appears in the existing InAppReminderBanner UI.",
        "The reminder content is English, chill/encouraging, and not aggressive or shaming.",
        "The streak-break reminder does not spam: at most once per local calendar day (per user/device) unless the user dismisses and re-enables it explicitly."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useReminderSchedulerContext.tsx",
          "operation": "modify",
          "description": "Extend the reminder scheduler to support a new reminder type for streak-break and expose a public method (via context) to fire a one-off reminder immediately; reuse the existing Notification API vs in-app fallback behavior for delivery."
        },
        {
          "path": "frontend/src/components/reminders/InAppReminderBanner.tsx",
          "operation": "modify",
          "description": "Update the in-app reminder banner to recognize and render the new streak-break reminder type (including an appropriate icon) while keeping the existing banner UI and dismissal behavior."
        },
        {
          "path": "frontend/src/hooks/useStreakBreakReminder.ts",
          "operation": "create",
          "description": "Implement a frontend hook that evaluates: current streak (from user rewards), whether today’s hydration goal is met (todays intake vs daily goal), local time vs end-of-day warning window, and local anti-spam state; when eligible, fire the streak-break reminder through the reminder scheduler context (Notification API if permitted, else in-app banner)."
        },
        {
          "path": "frontend/src/components/reminders/StreakBreakReminderController.tsx",
          "operation": "create",
          "description": "Add a small controller component that runs the streak-break reminder hook on an interval while the user is authenticated, ensuring reminders can fire without requiring the Reminders tab to be open."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the StreakBreakReminderController into the authenticated app shell (inside ReminderSchedulerProvider) so the streak-break reminder evaluation runs during normal app usage."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Add Reminders tab controls to enable/disable the streak-break reminder and configure the end-of-day warning window (hours before day end), persisted in localStorage and applied immediately.",
      "acceptanceCriteria": [
        "A user can toggle the streak-break reminder on/off from the Reminders tab.",
        "A user can adjust the warning window timing (hours before end of day) and the app uses that setting immediately.",
        "Settings persist across reloads on the same device via localStorage.",
        "All user-facing labels/help text are in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/reminders/ReminderControls.tsx",
          "operation": "modify",
          "description": "Add a new Streak-Break Reminder section to the existing Reminders UI with (1) an enable/disable toggle and (2) a numeric input for warning window hours before local day end; persist both preferences to localStorage and apply changes immediately (including clearing today’s “already fired” flag when the user explicitly toggles off then back on)."
        },
        {
          "path": "frontend/src/hooks/useStreakBreakReminder.ts",
          "operation": "modify",
          "description": "Read/write localStorage preferences for streak-break enablement and warning window hours, and read/write a local per-day anti-spam marker (e.g., last-fired local date) used by the reminder logic."
        }
      ]
    }
  ]
}