{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-09T04:25:47.775Z",
  "summary": "Diff adds Sleep and Running UI sections with logging + history, expands React Query hooks for sleep/running/custom reminders, and introduces a reminder scheduler context with in-app banner/notification fallback. Backend adds data types and some APIs for sleep logs, running logs, and custom reminder definitions with per-caller authorization checks. However, sleep scheduling settings and multi-type reminder scheduling (sleep/custom) are not evidenced as implemented.",
  "missing_requirements": [
    {
      "id": "REQ-9",
      "requirement": "Backend sleep scheduling settings APIs (enabled flag, target bedtime, target wake time, applicable days of week) + enforcement, in addition to sleep logs.",
      "reason": "Diff shows only sleep log storage/type and an addSleepLog function; no evidence of a sleep schedule settings model or get/update APIs.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-12",
      "requirement": "Sleep section UI includes configuring a sleep schedule (not just logging) and viewing recent sleep history.",
      "reason": "Sleep UI components shown (SleepView, SleepLogForm, SleepHistoryList) only support logging hours and listing history; no schedule configuration UI is evidenced.",
      "evidence": [
        "frontend/src/components/sleep/SleepView.tsx",
        "frontend/src/components/sleep/SleepLogForm.tsx",
        "frontend/src/components/sleep/SleepHistoryList.tsx",
        "frontend/src/App.tsx"
      ]
    },
    {
      "id": "REQ-13",
      "requirement": "Frontend React Query hooks include sleep schedule query/mutation hooks with proper cache invalidation and actor-not-available handling.",
      "reason": "useQueries.ts shows sleep log hooks (useAddSleepLog/useGetSleepHistory etc.) but no sleep schedule hooks are evidenced.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts"
      ]
    },
    {
      "id": "REQ-14",
      "requirement": "Reminder scheduler triggers and displays distinct reminder content for hydration vs sleep vs custom, with appropriate notification tags per type and in-app fallback when notifications fail/are not granted.",
      "reason": "ReminderSchedulerContext defines types ('hydration'|'sleep'|'custom') and in-app banner supports rendering different types, but the scheduling shown in startReminders only fires hydration reminders on an interval from hydration localStorage keys; no evidence of scheduling logic for sleep reminders or for user-defined custom reminder intervals/time-of-day firing.",
      "evidence": [
        "frontend/src/hooks/useReminderSchedulerContext.tsx",
        "frontend/src/components/reminders/InAppReminderBanner.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Hydration reminder notification title includes an emoji (\"Time to Hydrate! 💧\").",
      "reason": "BuildRequest requires all new user-facing text to be in English; emoji is not requested and may violate the English-only text constraint.",
      "evidence": [
        "frontend/src/hooks/useReminderSchedulerContext.tsx"
      ]
    },
    {
      "description": "Custom reminder definitions include extra fields (description, lastSent) and are keyed by a Text name map on the backend.",
      "reason": "REQ-11 only requires title, enabled flag, and schedule config; additional fields/storage strategy were not requested (though they may be acceptable).",
      "evidence": [
        "backend/main.mo"
      ]
    }
  ],
  "confidence": 0.74,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/components/reminders/InAppReminderBanner.tsx",
    "frontend/src/components/reminders/ReminderControls.tsx",
    "frontend/src/components/running/RunHistoryList.tsx",
    "frontend/src/components/running/RunLogForm.tsx",
    "frontend/src/components/running/RunningView.tsx",
    "frontend/src/components/sleep/SleepHistoryList.tsx",
    "frontend/src/components/sleep/SleepLogForm.tsx",
    "frontend/src/components/sleep/SleepView.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/hooks/useReminderSchedulerContext.tsx",
    "project_state.json"
  ]
}